In [2]:
import pandas as pd

In [3]:
s = pd.Series([1,2,3,4], index=["a","b","c","d"])
s

a    1
b    2
c    3
d    4
dtype: int64

# reindex metotu
## Açıklama : 
Belirlediğimiz indexlere göre veriyi yeniden düzenler. Olmayan bir index eklenmesi durumunda NaN olarak doldurur.
- Bu metot ile boş indexlere veri atanabilir.

### Series

In [7]:
s2 = s.reindex(["b","d","a","c","e"])
s2

b    2.0
d    4.0
a    1.0
c    3.0
e    NaN
dtype: float64

In [9]:
s3 = pd.Series(["mavi","sarı","yeşil"], index=[0,2,4])
s3

0     mavi
2     sarı
4    yeşil
dtype: object

In [15]:
s3 = s3.reindex(range(6), method="ffill")
s3

0     mavi
1     mavi
2     sarı
3     sarı
4    yeşil
5    yeşil
dtype: object

### DataFrame

In [17]:
import numpy as np

In [18]:
df = pd.DataFrame(np.arange(9).reshape(3,3), index=["a","c","d"],
                 columns=["Ali","Efe","Ece"])

In [19]:
df

   Ali  Efe  Ece
a    0    1    2
c    3    4    5
d    6    7    8

In [21]:
df2 =df.reindex(["d","c","b","a"])
df2

   Ali  Efe  Ece
d  6.0  7.0  8.0
c  3.0  4.0  5.0
b  NaN  NaN  NaN
a  0.0  1.0  2.0

In [22]:
df3 = df.reindex(["d","c","b","a"], method="ffill")
df3

   Ali  Efe  Ece
d    6    7    8
c    3    4    5
b    0    1    2
a    0    1    2

In [23]:
df4 = df.reindex(columns=["Efe","Ayşe","Ali"])
df4

   Efe  Ayşe  Ali
a    1   NaN    0
c    4   NaN    3
d    7   NaN    6

In [25]:
df5 = df.reindex(["d","c","b","a"], columns=["Efe","Ece","Ayşe"])
df5

   Efe  Ece  Ayşe
d  7.0  8.0   NaN
c  4.0  5.0   NaN
b  NaN  NaN   NaN
a  1.0  2.0   NaN

## loc ve iloc ile yeniden indeksleme yapma

In [31]:
df.loc[["c","d","a"]]

   Ali  Efe  Ece
c    3    4    5
d    6    7    8
a    0    1    2

## Satır veya Stun silme
### Drop metotu ile istenilen satır veya stun silinebilir

#### Series

In [35]:
s = pd.Series(np.arange(5), index=["a","b","c","d","e"])
s

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [36]:
yeni_s = s.drop("b")
yeni_s

a    0
c    2
d    3
e    4
dtype: int32

In [37]:
s.drop(["c","d"])

a    0
b    1
e    4
dtype: int32

#### DataFrame

In [58]:
veriS = pd.DataFrame(np.arange(16).reshape(4,4), index=[1,2,3,4],
                    columns=list("ABCD"))
veriS

    A   B   C   D
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [59]:
veriS.drop(columns=["D"])

    A   B   C
1   0   1   2
2   4   5   6
3   8   9  10
4  12  13  14

In [60]:
veriS.drop([1])

    A   B   C   D
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [61]:
veriS.drop("A", axis = 1)

    B   C   D
1   1   2   3
2   5   6   7
3   9  10  11
4  13  14  15

In [62]:
veriS.drop(2, axis = 0)

    A   B   C   D
1   0   1   2   3
3   8   9  10  11
4  12  13  14  15

## Satır veya Stunun Ortalama, Std, vb değerlerini alma

In [66]:
veriS.mean(axis = 0) #stunların ortalaması alır. 0 yerine "index" parametresi de kullanılabilir.

A    6.0
B    7.0
C    8.0
D    9.0
dtype: float64

In [68]:
veriS.mean(axis = 1) #satırların ortalamasını alır. 1 yerine "colum" parametresi de kullanılabilir.

1     1.5
2     5.5
3     9.5
4    13.5
dtype: float64